#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<time.h>

int fun(int);

int fun(int q)
{


}


main()//行列转换
{
	int a[3][3] = { 0,1,2,
					3,4,5,
					6,7,8, };
	int j, i, z;
	for (i = 0; i < 3; i++)
	{
		for (j = i + 1; j < 3; j++)
		{
			z = a[i][j];
			a[i][j] = a[j][i];
			a[j][i] = z;
		}


		for (i = 0; i < 3; i++)
		{
			for (j = 0; j < 3; j++)
			{
				printf("%5d", a[i][j]);
			}
			printf("\n");
		}
	}

}


//main()//冒泡排序,正确
//{
//	int i, j;//循环变量
//	int n[10];//定义数组10个下标
//	int z;//临时缓存变量
//	printf("*************************冒泡排序****************************\n");
//	printf("请输入10个数值:\n");
//
//	for (i = 0; i < 10; i++)
//		scanf("%d", &n[i]);//保存数值到数组
//
//	//主要部分
//	for (i = 0; i < 9; i++)
//		for (j = 0; j < 9 - i; j++)
//		{
//			if (n[j] > n[j + 1])//数值前后比较
//			{
//				z = n[j];//n[j]里的数值缓存到z
//				n[j] = n[j + 1];//n[j + 1]里小数值传给n[j]
//				n[j + 1] = z;//n[j]里的数值缓存到z，z赋值给n[j + 1]
//			}
//		}
//
//	for (i = 0; i < 10; i++)//循环输出数组里的数值
//		printf("%d ", n[i]);
//}


//main()//选择排序，真确
//{
//	int i, j;//循环里用的变量
//	int  z;//互换数据的临时变量
//	int n[10];//十个数值保存在这个数组里，数组定义有10个下标，一个下标保存一个元素
//	int m;
//	printf("请输入十个数值：\n");
//
//	for (i = 0; i < 10; i++)//循环把输入的数值存到数组里
//		scanf_s("%d", &n[i]);
//
//	printf("没有排序的数值：\n");
//	for (i = 0; i < 10; i++)//循环输出数组里所有没有排序的数值
//		printf("n[%d]=%d\n", i, n[i]);//i是下标，n[i]是元素，就是你存放的数值
//
//	printf("最终排序好的数值：\n");
//
//	//主要部分
//	for (i = 0; i < 10; i++)
//	{
//		m = i;
//		for (j = i + 1; j < 10; j++)//找到每一次循环的最小的下标
//		{
//			if (n[m] > n[j])//判断下标m的元素是不是大于下标j的元素，目的是找到最小的元素值然后记住它的下标
//			{
//				m = j;//保存本次循环最小的下标
//			}
//		}
//		if (m != i)//找到最小数之后如果它的下标不是i则说明它不在最左边, 则互换位置
//		{
//			z = n[m];//n[m]小的值缓存都在z
//			n[m] = n[i];//互换， n[i]里大的值给n[m]
//			n[i] = z;//z把小的值给n[i]
//		}
//
//		printf("n[%d] = %d\n", i, n[i]);//依次输出元素和元素数值
//	}
//
//	for (i = 0; i < 10; i++)//输出全部元素数值
//		printf("%d ", n[i]);
//}


/*main()//二维输出
{
	int a = 0, c, x, b[2][3] = { 100,105,110,115,120 ,130};

	for (a = 0; a <= 1; a++)
	{

		for (c=0;c<=2;c++)
		{
			printf("%d ", b[a][c]);
		}
		printf("\n");
	}
}*/

/*
main()//数组前后顺序转换输出，再从前输出
{
	int a = 0, c, x, b[5] = { 100,105,110,115,120 };

	for (a = 0; a <= 4; a++)	//数组前后顺序转换，从后向前输出
	{
		c = b[4 - a];
		printf("%d ", c);
		b[4 - a] = c;//存到数组里
	}
	printf("\n");

	for (a = 0; a <= 4; a++)//从前输出
	{
		printf("%d ", b[a]);
	}
}*/

/*
void main()//*****************************一维数组练习
{
	for (int b = 0; b <= 10; b++)
	{
		printf("%d ", b);
		if (b == 10)
			printf("\n");
	}

	for (int a = 1; a <= 10; a++)
	{
		printf("%d\n", a);
	}

	for (int c = 2; c <= 10; c++)
	{
		printf("%d\n", c);
	}
}*/


/*void main()
{
	int a[20] ;
	int b;
	for (b = 0; b <= 19; b++)
	{
		printf("%X\n", a[b]=b); //b++的值赋值在数组a中并打印
	}

}*/

/*void main()
{
	int a[20];
	for (int b = 0; b <= 19; b++)
	{
		printf("%X  ",a[b]=b);
		if ((b + 1) % 3 == 0)//每行输出三个数，因为数组的下标b从0开始，所以先加个1再除3取余数
			printf("\n");
	}*/